Project - Part 2 (from 7.14.2)

In [1]:
import pandas as pd

In [2]:
grades_dict = {'Wally' : [87, 95, 89,] , 'Eva' : [100, 87, 90,] , 'Sam' : [94, 77, 90,], 'Katie' : [100, 81, 82,], 'Bob' : [83, 65, 85]}

In [3]:
grades = pd.DataFrame(grades_dict)

In [4]:
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     95   87   77     81   65
2     89   90   90     82   85

In [5]:
grades.index = ['Test1', 'Test2', 'Test3']

In [6]:
grades.at['Test2', 'Eva']

87

In [7]:
grades.iat[2,0]

89

In [8]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   90.333333   92.333333  87.000000   87.666667  77.666667
std     4.163332    6.806859   8.888194   10.692677  11.015141
min    87.000000   87.000000  77.000000   81.000000  65.000000
25%    88.000000   88.500000  83.500000   81.500000  74.000000
50%    89.000000   90.000000  90.000000   82.000000  83.000000
75%    92.000000   95.000000  92.000000   91.000000  84.000000
max    95.000000  100.000000  94.000000  100.000000  85.000000

In [9]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   90.333333   92.333333  87.000000   87.666667  77.666667
std     4.163332    6.806859   8.888194   10.692677  11.015141
min    87.000000   87.000000  77.000000   81.000000  65.000000
25%    88.000000   88.500000  83.500000   81.500000  74.000000
50%    89.000000   90.000000  90.000000   82.000000  83.000000
75%    92.000000   95.000000  92.000000   91.000000  84.000000
max    95.000000  100.000000  94.000000  100.000000  85.000000

In [10]:
round(grades.describe(),1)

       Wally    Eva   Sam  Katie   Bob
count    3.0    3.0   3.0    3.0   3.0
mean    90.3   92.3  87.0   87.7  77.7
std      4.2    6.8   8.9   10.7  11.0
min     87.0   87.0  77.0   81.0  65.0
25%     88.0   88.5  83.5   81.5  74.0
50%     89.0   90.0  90.0   82.0  83.0
75%     92.0   95.0  92.0   91.0  84.0
max     95.0  100.0  94.0  100.0  85.0

In [11]:
round(grades.mean(),1)

Wally    90.3
Eva      92.3
Sam      87.0
Katie    87.7
Bob      77.7
dtype: float64

In [12]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     89   90   90     82   85
Test2     95   87   77     81   65
Test1     87  100   94    100   83

In [13]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     95
Test3   85   90     82   90     89

In [14]:
#Mike Abbinante